'''
Задача №1
В один ряд поставили n кеглів, пронумерувавши їх зліва направо числами від 1 до n.
Потім в цей ряд кинули k куль, при цьому i-та куля збила всі кеглі з номерами від m до h включно.
Визначте, які кеглі залишилися стояти на місці.
Програма отримує на вхід кількість кеглів n і кількість кидків k.
Далі йде k пар чисел m, h, при цьому 1 ≤ m ≤ h ≤ n ≤ 100.
Програма повинна вивести послідовність з n символів,
де j-й символ є I, якщо j-та кегля залишилася стояти, або ., якщо j-та кегля була збита.

Автор: Задворна Анастасія Богданівна
'''

n, k = input().split()
n = int(n)
k = int(k)

pins = ['I'] * n  

for _ in range(k):
    throw = input().split()
    m = int(throw[0])
    h = int(throw[1])
    for i in range(m - 1, h):
        pins[i] = '.'

print(''.join(pins))
